################################################################################################

print("\n Пример 1:")
#   Читаем весь файл
some_file = open("ex1.txt", "r", encoding='utf-8')  # Открываем файл; r - флаг на чтение

print(some_file.read())  # Чтобы прочитать файл полностью используем read()

some_file.close()  # Закрыл файл

################################################################################################

print("\n Пример 2:")
#   Читаем часть файла
some_file = open("ex1.txt", "r", encoding='utf-8')

print(some_file.read(16))

some_file.close()

################################################################################################

print("\n Пример 3:")
#   Читаем следующие 18 символов

some_file = open("ex1.txt", "r", encoding='utf-8')

print(some_file.read(16))
print(some_file.read(18))

some_file.close()

################################################################################################

print("\n Пример 4:")
#   Указываем, куда поставить курсор

some_file = open("ex1.txt", "r", encoding='utf-8')

print(some_file.read(16))
some_file.seek(0)
print(some_file.read(18))

some_file.close()

################################################################################################